[
  {
    "title": "About Crawfish Season",
    "sections": {
      "When is Crawfish season?": "Crawfish season is not as easily defined as other seasons, such as crab or shrimp, because it is not legally regulated. However, that is not to say that there is not the “ideal time” to purchase and eat live crawfish. There are actually three factors that play heavily into when crawfish season happens:\r\n1.\tThe Crawfish are readily available.\r\n2.\tThey are cheap enough to afford.\r\n3.\tThey are big enough to enjoy and be worth the effort.\r\nIn a normal year, these three planets align around the beginning of March and the season ends sometime in June. \r\n",
      "What Cause Crawfish Season?": "Rain and temperature have the biggest effect on when Crawfish season actually begins. Crawfish need a lot of rain and warmer temperatures to grow, and this usually happens in late February or early March. However, if the winter is exceptionally wet, and then warmer temperatures creep in early, you will see crawfish prices drop a little earlier.\r\nAnd if the Crawfish are ready to boil, so are Louisianans. \r\n",
      "Crawfish Supply and Demand": "As far as the price and size of the crawfish, it really comes down to supply and demand. It’s simple economics, really. As the amount of available crawfish goes up, so does the demand for them. One crawfish boil leads to another, to another, and pretty soon crawfish farms are overrun with people hungry for their spring treat. However, the crowding at the crawfish farms – of both crawfish and people – means that the crawfish size will start to decrease. It is the job of the crawfish farmers to find a balance in their harvesting to help keep a steady supply of crawfish, while meeting the demands of the consumer.",
      "Can You Buy Live Crawfish Year-Round?": "The short answer here is yes. When out of season, you can switch to our cooked crawfish. This is a great alternative, and if cooked correctly, tastes exactly like the live crawfish.\r\nIf you would like to purchase live, Louisiana crawfish, we have a great selection and can ship them to you fast! Check out our Live Crawfish page to find the perfect solution to your next crawfish boil!\r\n"
    }
  },
  {
    "title": "About Crawfish",
    "sections": {
      "Information on Crawfish as food": "Crayfish are eaten worldwide. Like other edible crustaceans, only a small portion of the body of a crayfish is eaten. In most prepared dishes, such as soups, bisques and étouffées, only the tail portion is served. At crawfish boils or other meals where the entire body of the crayfish is presented, other portions, such as the claw meat, may be eaten. Like all crustaceans, crayfish are not kosher because they are aquatic animals that do not have both fins and scales. They are therefore not eaten by observant Jews.\r\nAs of 2005, Louisiana supplies 95% of the crayfish harvested in the US. In 1987, Louisiana produced 90% of the crayfish harvested in the world, 70% of which were consumed locally.In 2007, the Louisiana crawfish harvest was about 54,800 tons, almost all of it from aquaculture.About 70%–80% of crayfish produced in Louisiana are Procambarus clarkii (red swamp crawfish), with the remaining 20%–30% being Procambarus zonangulus (white river crawfish).\r\n",
      "Information on Crawfish as bait": "Crayfish are commonly sold and used as bait, either live or with only the tail meat, and are good at attracting channel catfish, walleye, trout, largemouth bass, smallmouth bass, pike and muskellunge. Sometimes the claws are removed so that the crayfish dont stop fish from biting the hook. Crayfish easily fall off the hook, so casting should be slow.\r\nThe result of using crayfish as bait has led to various ecological problems at times. According to a report prepared by Illinois State University, on the Fox River and Des Plaines River watershed, \"The rusty crayfish (used as bait) has been dumped into the water and its survivors outcompete the native clearwater crayfish\". This situation has been repeated elsewhere, as the crayfish bait eliminates native species\r\nThe use of crayfish as bait has been cited as one of the ways zebra mussels have spread to different waterways, as members of this invasive species are known to attach themselves to crayfish.\r\n"
    }
  },
  {
    "title": "About Doberge Cake",
    "sections": {
      "General Information about Doberge Cake": "Doberge cake is a layered dessert originating in New Orleans, Louisiana, adapted by local baker Beulah Ledner from the Hungarian Dobos torte. Still popular in the area, the cake is made of multiple thin layers of cake alternating with dessert pudding. Very often the cakes are made with half chocolate pudding and half lemon pudding. They are covered in a thin layer of butter cream and a fondant shell or, alternatively, a poured glaze on the outside. They are normally made with six or more layers, but many amateurs make versions with fewer. Traditional flavors are chocolate, lemon and caramel.",
      "History of Doberge Cake": "Beulah Levy Ledner, born into a Jewish family in St. Rose, Louisiana, opened a bakery in New Orleans in 1933. She became very successful after creating her \"Doberge cake\" adapted from the famous Hungarian\/Austrian Dobos Cake, a cake made of nine génoise cake layers filled with buttercream and topped with a hard caramel glaze. The doberge cake is based on a recipe originating in Alsace-Lorraine. Ledner replaced the buttercream filling of the Dobos Cake with a custard filling and iced the cakes with buttercream and a thin layer of fondant. \r\nBeulah Ledner's recipe is available in the cookbook, Let's bake with Beulah Ledner: A legendary New Orleans Lady by Maxine Wolchansky. \r\nIn 1946 Joe Gambino bought the name, recipe and retail shop, including her recipe for doberge cake and a promise that she would not reopen in New Orleans for five years. After a couple of years of illness, she reopened in a new location on Metairie Road in the New Orleans suburb of Metairie under the name \"Beulah Ledner, Inc.\" As her business and popularity grew, her son, Albert, designed and built a new building and a new machine to mass-produce sheet cakes using his mother's recipes. She opened her new bakery on May 21, 1970; she ran it until she retired in 1981 the age of 87, when she sold the shop and doberge recipe to Maurice's French Pastries, which is still in the business of baking and selling doberge cakes in Metairie."
    }
  },
  {
    "title": "About Grits",
    "sections": {
      "General Information about Grits": "Grits is a food made by boiling ground maize (also known as corn), and usually served with other flavorings as a breakfast dish, usually savory. It is popular in the Southern United States.\r\nGrits is of Native American origin, and is similar to other thick maize-based porridges from around the world such as polenta.\r\nModern grits are commonly made of alkali-treated corn known as hominy, in which case it may be called \"hominy grits\". \"Instant grits\" and \"quick grits\" use hominy processed for faster cooking, widely sold in supermarkets.\r\nThe word \"grits\" may be treated as either singular or plural; historically, in the American South it was always singular. It derives from the Old English word \"grytt,\" meaning coarse meal.\r\n",
      "History of Grits": "Grits have their origin in Native American corn preparation. Traditionally, the hominy for grits was ground on a stone mill. The ground hominy is then passed through screens, the finer sifted material used as grit meal, and the coarser as grits. Many American communities used a gristmill until the mid-twentieth century, farmers bringing their corn to be ground, and the miller keeping a portion as his fee. State law in South Carolina requires grits and corn meal to be enriched, similar to the requirement for flour, unless the grits are made from the corn a miller kept as his fee. \r\nThree-quarters of grits sold in the U.S. are bought in the South, in an area stretching from Texas to Virginia that is sometimes called the \"grits belt\". The state of Georgia declared grits its official prepared food in 2002.[4] Similar bills have been introduced in South Carolina.\r\n",
      "Preparing Grits": "Whole kernel grits are prepared by adding five or six parts boiling water (seasoned with salt - 1\/4 tsp for each cup of water) to one part grits and cooking for 20 to 45 minutes. Grits expand when cooked and need periodic stirring to prevent sticking, and lumps from forming. They are not done until they have absorbed four times their volume of water. The additional water allows for some evaporation as they cook. Whole grain grits require much longer to become soft than do \"quick grits.\" Grits are most typically served seasoned with salt and pepper, as well as generous amounts of butter. On occasion they are served with grated cheese, sausage, bacon, or red-eye gravy. Grits may also be seasoned with butter and sugar, and a small amount of salt, giving them a salty-sweet flavor similar to kettle corn.\r\nExtra, i.e. left-over, grits can be put into a glass tumbler, chilled until needed, sliced into slabs with a taut string, and fried, either plain or with a breading. In this form they are denominated \"fried grits\"\r\n",
      "Grit Dishes": "Grits are eaten with a wide variety of foods, such as eggs and bacon, fried catfish, salmon croquettes, country ham, and many other dishes.\r\nShrimp and grits is a traditional dish in the Low Country of coastal Alabama, Mississippi, Florida, Louisiana, South Carolina, North Carolina, Georgia, Virginia, and Maryland. A variation of the dish also is consumed for breakfast in the northern states of Kedah and Perlis in peninsular Malaysia. It is a traditional breakfast dish.\r\n\"Charleston-style grits\" are boiled in milk instead of water, giving them a creamy consistency.\r\nSolidified cooked grits can be sliced and fried directly in vegetable oil, butter, or bacon grease, or they can first be breaded in beaten egg and bread crumbs.\r\n"
    }
  },
  {
    "title": "About King Cake",
    "sections": {
      "General Information about King Cake": "A king cake (sometimes shown as king cake, kings' cake, king's cake, or three kings cake) is a type of cake associated in a number of countries with the festival of Epiphany at the end of the Christmas season; in other places, it is associated with the pre-Lenten celebrations of Mardi Gras\/Carnival.\r\nWhat started out, roughly 300 years ago, as a dry French bread–type dough with sugar on top and a bean inside is now a sweet, sugary and iced Danish-type dough braided with cinnamon inside and a plastic doll underneath. King cakes are made of a cinnamon-filled dough in the shape of a hollow circle. They have a glazed topping and are sprinkled with colored sugar. Hundreds of thousands of King Cakes are eaten in New Orleans during the Carnival season.\r\nThe cake often has a small plastic baby (said to represent Baby Jesus) inside, or underneath; and the person who gets the piece of cake with the trinket has various privileges and obligations.\r\n",
      "History of King Cake": "The \"king cake\" takes its name from the biblical three kings. In Catholic liturgical tradition, the Solemnity of Epiphany—commemorated on January 6—celebrates the visit of the Magi to the Christ Child. The Eve of Epiphany (the night of January 5) is popularly known as Twelfth Night (the Twelve Days of Christmas are counted from Christmas Eve until this night). The season for king cake extends from the end of the Twelve Days of Christmas (Twelfth Night and Epiphany Day), up until Mardi Gras, or \"Fat Tuesday;\" the day before the start of Lent. Some organizations or groups of friends may have \"king cake parties\" every week through the Carnival season. In Portugal and France, whoever gets the King cake trinket is expected to buy the next cake for these get-togethers.\r\nIt is a popular food item during the Christmas season (Christmas Eve to Epiphany) in Belgium, France, Quebec and Switzerland (galette orgâteau des Rois or galette des rois), Portugal (bolo rei), Spain, and Latin America (roscón or rosca de reyes and, Greece and Cyprus (vasilopita) and Bulgaria (banitsa). In the United States, Carnival is traditionally observed in the Southeastern region of the country, particularly in New Orleans, Saint Louis, Mobile, Pensacola, Galveston, and other towns and cities of the Mississippi Gulf Coast. In this region, the king cake is closely associated with Mardi Gras traditions and is served throughout the Carnival season, which lasts from Epiphany Eve to Fat Tuesday.[3]\r\nIt’s believed the festivities of Carnival were brought to Louisiana by French-Canadian explorer Pierre Le Moyne d'Iberville. He led an expedition on behalf of the French crown and on March 2, 1699, he set up camp along the Mississippi River, 60 miles south of the present location of New Orleans. It just so happened the next day was Mardi Gras, and so began its celebration. The King Cake tradition is thought to have been brought to New Orleans from France in 1870.[4] Now, as part of the celebration, it is traditional to bake a cake (King Cake) in honor of the three kings. The official colors of Mardi Gras–created in 1872 by the Krewe of Rex–purple for justice, green for faith, and gold for power.\r\n",
      "The King Cake Trinket / Baby": "Traditionally, a small plastic or porcelain baby is hidden into the king cake. It is usually green, gold, or purple to represent the colors of the holiday. Originally, the baby was placed into the cake to symbolize baby Jesus. Fava beans were also used to represent Jesus.\r\nToday, the baby symbolizes luck and prosperity to whoever finds it in his\/her slice of cake. In some traditions, the finder of the baby is designated “king” or “queen” for the evening. That person is also responsible for purchasing next year’s cake,[8] or for throwing the next Mardi Gras party.\r\nMany bakers have recently been placing the baby outside of the cake, and leaving the hiding to the customer. There is a potential of customers choking on or swallowing the baby, and bakers want to stay clear of this responsibility.\r\n",
      "Importance of King Cake for New Orleans": "The King Cake is synonymous with Mardi Gras tradition in New Orleans. Starting on Epiphany on January 6, residents begin holding parties especially dedicated to King Cake. King Cake parties bring families and community members together to celebrate the joyous season of Mardi Gras, with its celebratory krewe parades and festivals. In fact, many in New Orleans take more pride in the Mardi Gras King Cake tradition than the parades. The dessert’s ability to engage friends and family in the “search for the baby,” the small figurine located inside the cake, is a fun way for residents of New Orleans to celebrate their Christian faith.[10]\r\nThe dessert’s significance to the city was evident in the first Mardi Gras season after Hurricane Katrina in 2006. Thousands and thousands of King Cake orders flooded bakeries both inside and outside of Louisiana. This showed that in a time of great need, the people of New Orleans felt security and safety in being able to gather around King Cakes after the disastrous storm. King Cake demand after Hurricane Katrina thus provided another example of how significant the dessert’s tradition is both inside and outside of the region.[\r\n",
      "General Ingredients for King Cake": "There are many different recipes for king cake. However, the most common ones include: milk, butter, yeast, water, brown and white sugar, eggs, salt, nutmeg, flour and cinnamon. The frosting is typically made from confectioner's sugar, water, lemon juice, and colored sugar crystals."
    }
  },
  {
    "title": "About Pralines",
    "sections": {
      "General Information about Pralines": "Praline (US \/ˈpreɪliːn\/;UK \/ˈprɑːliːn\/) is a form of confectionery containing at a minimum nuts and sugar; cream is a common third ingredient.\r\nThere are two main types:\r\n•\tFrench pralines, a firm combination of almonds and caramelized sugar.\r\n•\tAmerican pralines, a softer, creamier combination of syrup and pecans, hazelnuts or almonds with milk or cream, resembling fudge.\r\nBelgian pralines consist of a chocolate shell with a softer, sometimes liquid, filling, traditionally made of different combinations of hazelnut, almonds, sugar, syrup and often milk-based pastes. These high-fat, low-melting point chocolates are at the luxury end of Belgian chocolate and represent an important product of many Belgian chocolatiers.\r\nA praline cookie is a chocolate biscuit containing ground nuts.\r\n",
      "History of the Praline": "As originally inspired in France at the Château of Vaux-le-Vicomte by the cook of the 17th-centurysugar industrialist Marshal du Plessis-Praslin (1598–1675), early pralines were whole almonds individually coated in caramelized sugar, as opposed to dark nougat, where a sheet of caramelized sugar covers many nuts. Although the New World had been discovered and settled by this time, chocolate-producing cocoa (native to the New World) was originally not optionally associated with the term. The European chefs used local nuts such as almonds and hazelnuts.\r\n The powder made by grinding up such caramel-coated nuts is called pralin, and is an ingredient in many cakes, pastries, and ice creams. After this powder has been mixed with chocolate, it becomes praliné in French, which gave birth to what is known in French as chocolat praliné. The word praliné is used colloquially in France and Switzerland to refer to these, known simply as \"chocolates\" in English, i.e. various centres coated with chocolate. In mainland Europe, the word praline is often used to mean either this nut powder or the chocolate paste made from it, widely used to fill chocolates, hence its use (by synecdoche) in Germany, the Netherlands, Belgium and the United Kingdom to refer to filled chocolates in general. In the United Kingdom, the term can refer either to praline (the filling for chocolates) or, less commonly, to the original whole-nut pralines.\r\n",
      "Pralines in Louisiana": "French settlers brought the recipe to Louisiana, where both sugar cane and pecan trees were plentiful. During the 19th century, New Orleans chefs substituted pecans for almonds, added cream to thicken the confection, and thus created what became known throughout the American South as the praline.\r\nPralines have a creamy consistency, similar to fudge. It is usually made by combining sugar (often brown), butter, and cream or buttermilk in a pot on medium-high heat, and stirring constantly, until most of the water has evaporated and it has reached a thick texture with a brown color. Then it is usually dropped by spoonfuls onto wax paper or a sheet of aluminum foil greased with butter, and left to cool.  \r\n'Pralines and cream' is a common ice cream flavor in the United States and Canada.\r\n"
    }
  },
  {
    "title": "The Holy Trinity",
    "sections": {
      "The Holy Trinity": "The holy trinity of Cajun cooking is made up of onion, celery, and bell pepper. This combination is the base of most savory dishes, more often than not added to roux as the beginning of stew, soup, sauce, jambalaya, sauce piquant or almost any other Cajun main dish.",
      "A Sign of Importance and Respect": "The importance of these three vegetables is indicated by the reference to the “holy trinity.” The mostly Catholic French Cajuns’ mean this allusion as a sign of the respect due to the place of onion, celery, and bell pepper in Cajun cookery.\r\nGarlic is sometimes added to the trinity, and green onions and parsley are generally sprinkled on top of a finished dish.\r\n",
      "Seasoning Vegetables": "With these five vegetables, one has the makings of almost any savory Cajun entrée. Other seasonings include pepper—often black, white, and cayenne—bay leaves, and dried green herbs such as thyme, basil, and oregano.\r\nThe trinity vegetables are known as “seasoning vegetables,” meaning that they break down during the long, slow cooking process and season the rest of the ingredients. They are not intended to be the vegetable component of a meal.\r\n",
      "Proportions": "A typical “trinity” includes 2 cups chopped onion, 1 ½ cups chopped celery, and 1 ¼ cups chopped green bell pepper. In terms of how much to buy for this proportion, this amount is roughly equal to 2 medium onions, 2 stalks celery, and 1 large green pepper. The vegetables are usually cooked in oil, to which flour is then added before proceeding with the recipe.",
      "The Trinity in the Pantry": "And speaking of chopping up, do just that—chop the vegetables. Cajuns don’t worry about or specify mincing, dicing, finely chopping, or coarsely chopping. They just chop the vegetables and put them in a pot with other common ingredients…yet, they continue to end up with some of the best tasting dishes in the world! So keep onions, celery, bell pepper, green onions, parsley, and garlic in your refrigerator or pantry and you’ll never be without the makings of a fabulous Cajun meal!"
    }
  },
  {
    "title": "History of Tobasco Sauce",
    "sections": {
      "The Peppers": "Edmund McIlhenny was given seeds of Capsicum frutescens peppers that came from Mexico or Central America, and he first planted them on Avery Island, Louisiana, over 140 years ago (1869). Peppers used for Tobasco Sauce are picked by hand when they turn the appropriate shade of red. (Young peppers are green and then turn yellow, orange and, finally, deep red as they age.) Pickers carry a small wooden dowel referred to as “le petit bâton rouge,” painted the preferred hue of red that they can use to tell if a pepper is the correct shade.\r\n\r\nNot all Tobasco peppers are grown on Avery Island. In 1965, McIlhenny Company ran out of room on the Island and started growing additional peppers in Latin America. (All the seeds are still grown on Avery Island before being sent to Latin America, where they are planted and grow into peppers.) When those peppers are harvested, they’re shipped back to Avery Island for the next step in the process.\r\n\r\nAged for up to Three Years\r\nOnce peppers are picked, they are mashed, mixed with a small amount of Avery Island salt extracted from the salt mines that lie beneath the Island, and placed in oak barrels. The wooden barrel tops are covered with more Avery Island salt to form a natural protective barrier, and the pepper mash is allowed to age for up to three years in the McIlhenny warehouse. This process creates the subtle flavor notes that are unique to our Original Red Sauce.\r\n\r\nMcIlhenny Family’s Close Supervision\r\nThe mash is inspected by a member of the McIlhenny family. When approved, the fully aged mash is then blended with high-quality distilled vinegar. Numerous stirrings and about four weeks later, the pepper skins, pulp and seeds are strained out using three different-sized screens. Then the “finished” sauce is bottled by modern methods, labeled in 22 languages and dialects, and prepared for shipment to over 180 countries and territories around the world.\r\nThe following year’s pepper crop is insured by the McIlhennys, who personally select the best plants in the field during harvest. The pepper seeds from those select plants are treated and dried for use the following year, and then they are stored both on the Island and in a local bank vault as a hedge against any disaster that might befall future crops.\r\n",
      "History of Avery Island": "Avery Island isn't really an island, but more of a dry mound (a salt dome) surrounded by wetlands. It's about 165 feet high and that makes it the tallest point in the Gulf Coast.\r\nThe island is owned entirely by the Avery family, of which the McIlhennys form a branch. The first of them on the island was a man named Marsh, who built the Marsh House in 1818 that is still used for family weddings and other gatherings. Marsh wasn't a pepper sauce maker, but grew sugar cane on the part of the island that he owned. There are remains of three sugar refineries still on the island, and sugar cane is still grown in the surrounding area.\r\nMarsh's son-in-law, who was an Avery, bought the rest of the island. This Avery's daughter married a McIlhenny, so that's where the families come together. And it was this McIlhenny who invented Tabasco sauce.\r\nAt some point, they discovered that the island was rich in salt deposits. Salt is still mined on the island by the Cargill company, and they've now drilled to 2000 feet below ground to do so. Every night, they detonate an explosive underground to ready some more salt for harvest, and sometimes you can hear the boom from the Marsh House.\r\nDuring the Civil War, the families fled New Orleans to live on the island and escape the conflict. But armies need salt, for preservatives and for animals, so the war soon came to them. They were making salt for the Confederate army and the Union army tried to seize the island in a conflict that came to be known as \"The Great Salt Expedition.\" Though this was a victory for the Confederates, the Union won the island just six months later.\r\nAfter the Civil War, Edmund McIlhenny, a banker whose industry had been destroyed by the conflict, succeeded in his venture creating a pepper sauce. (It wasn't the first pepper sauce in America, though they were not common. It was said people initially complained that the sauce was too hot, as they applied it in quantities like the ketchup they were used to.) He grew peppers and developed the recipe from 1866-1868, and sold his first Tabasco sauce in 1869.\r\nUnlike most brands who tout their recipe as being identical to the original, Tabasco has definitely changed. Initially, the pepper mash was aged for 30 days in jars, then vinegar was added and it aged for another 30 days.\r\n",
      "Tabasco Today" : "Today, Tabasco sauce is a global business, but all of it still originates and is processed on the island. The seeds for all the peppers grown for Tabasco originate on the island, picked from the best plants, then peppers used in the sauce are grown in Guatemala, Mexico, Honduras, Columbia, Ecuador, Peru, South Africa, Zambia, Zimbabwe, and Mozambique.\r\n\r\nAround the world the peppers are all hand-picked, ground up, have eight percent salt added (in South America, the salt they use is actually sent from Avery Island), and then the peppers ferment for a month before they're shipped back to Avery Island.\r\nBack on the island, the \"pepper mash\" is aged in ex-bourbon barrels- about 50,000 of them here at the warehouse. The barrels are first de-charred and re-hooped, as the acidity of the mash would eat right through the typical barrel hoops. The pepper mash then ages in a barrel for three years on Avery Island, stacked six-high on top of each other.\r\nNot only is there salt used in the pepper mash, salt is added on top of each barrel. The barrels have a valve on top that releases carbon dioxide from the fermenting peppers, and it bubbles through the salt. When the fermentation is done, the salt forms a hard rock salt puck on top of the barrel, helping to seal the valve.\r\n\r\nThe three-year-old pepper mash is then added to vinegar and aged for up to 28 days before bottling. Peppers make up about twenty percent of the final product.\r\nThe actual peppers register from 40,000 to 50,000 on the Scoville scale, but after aging and dilution the final Tabasco sauce is around 2,500 to 5,000 Scoville heat units.\r\nInside the warehouse, we were able to taste the pepper mash- just putting a bit on our tongues and then spitting it out. As expected, it's hot as heck. But as a reward for doing so, we are given a necklace with a spoon attached, engraved with N.S.A.O. N.S.S.S. - allowing us membership into the The Not So Ancient Order of the Not So Silver Spoon.\r\nMy fellow Tabasco taster Amy Sherman made an illustration of me undergoing the initiation.\r\nAfter they make the Tabasco sauce, the spent peppers are sold to a pharmaceutical company that makes things like pepper spray and medicinal applications.\r\n",
      "Types of Tabasco": "The main line of Tabasco sauces now includes the Original, Green (jalapeno, the first sauce extension from 1993), Chipotle, Buffalo, Habanero, Garlic Pepper, and Sweet & Spicy."
    }
  },
  {
    "title": " Tabasco Today",
    "sections": {

    }
  }
]