[
  {
    "title": "Baked Beans and Barbecue Sauce",
    "sections": {
      "Recipes": "Baked Beans\r\n\r\n6 slices bacon\r\n1\/3 tsp chili powder\r\n1 large can pork & beans\r\n1 onion (chopped)\r\n1 cup ketchup\r\n1\/2 cup brown sugar\r\nFry bacon and combine with other ingredients in casserole dish. Bake at 350 degrees for 30-45 minutes.\r\n\r\n\r\nBarbecue Sauce Recipie\r\nMrs. Howard's Barbecue Sauce, ca. 1913:\r\n1\/4 pound butter\r\n1\/4 cup water\r\n1 teaspoon dry mustard\r\n1 teaspoon tabasco sauce\r\nDash of cayenne\r\nChopped parsley\r\n2 tablespoons tomato catsup\r\n2 tablespoons lemon juice\r\n2 tablespoons vinegar\r\n1\/2 teaspoon onion salt\r\n1 tablespoon tomato sauce\r\n",
      "Background": "In 1492 as the Spanish explored the New World, they discovered the natives had a wooden device for smoking fish, lizards, and small animals which to them sounded like \"barbacoa\". Smoked meats were common in Europe long before Columbus, both for the flavor and because smoke helped preserve food, but the barbacoa technique was different and it quickly became popular with explorers.\r\nThe first barbecue sauces were mostly butter. In \"Nouveaux Voyages aux Isles d'Amerique\" by Frenchman Jean B. Labot in 1693, there is a description of a barbecued whole hog that is stuffed with aromatic herbs and spices, roasted belly up, and basted with a sauce of melted butter, cayenne pepper, and sage, a popular technique from back home that probably came to the new world via the French West Indies by slaves and Creoles. The French are incapable of making anything without butter. The French also were big on meat juices in their sauces, an ingredient still found in some homebrewed Texas barbecue sauces and more recently in Adam Perry Lang's Board Sauces.\r\nThe German fondness of pork with mustard resulted in the wonderful yellow barbecue sauces still popular in a band of South Carolina from Charleston to Columbia.\r\nIn 1867, just after the end of the Civil War, after all the slave cooks were freed, the Georgia widow Mrs. A.P. Hill published Mrs. Hill's New Cook Book dedicated \"to young and inexperienced Southern housekeepers... in this peculiar crisis of our domestic as well as national affairs\". It contains the first reference I have found for a sauce for barbecue. It is mostly butter and vinegar: \"Sauce for Barbecues. - Melt half a pound of butter; stir into it a large tablespoon of mustard, half a teaspoon of red pepper, one of black, salt to taste; add vinegar until the sauce has a strong acid taste. The quantity of vinegar will depend upon the strength of it. As soon as the meat becomes hot, begin to baste, and continue basting frequently until it is done; pour over the meat any sauce that remains.\" Interestingly, Mrs. Hill shares many \"catsup\" recipes, among them two for tomato catsup that are pretty close to what we know today. Originally ketchup was probably made from fermented fish.\r\nThe first mention of \"barbecue sauce\" found in text was in the Bolivar Bulletin from Hardeman County, TN in 1871. The author of an article thanks a Dr. J.H. Larwill for \"a fine lot of Barbecue Sauce, of his own invention. For fresh meats of all kinds it cannot be excelled.\"\r\nAccording to an article in Eatocracy, several newspaper articles from the 1880s described barbecue sauces like Mrs. Hills: Mostly butter and vinegar seasoned with salt and black pepper, not unlike the sauces still popular on the coast of the Carolinas today.\r\n"
    }
  },
  {
    "title": "Crawfish Pasta and Bisque",
    "sections": {
      "Crawfish Pasta": "Ingredients:\r\n1 (16 ounce) package bow tie pasta  \r\n3\/4 stick butter\r\n1 clove garlic, minced  \r\nsalt and pepper to taste  \r\n1 yellow onion, chopped  \r\n1 tablespoon crushed red pepper flakes, divided  \r\n1 pound crawfish tails  \r\n2 pints heavy cream  \r\n1\/2 tablespoon crushed red pepper flakes  \r\n1 bunch green onions, chopped  \r\nDirections: \r\nBring a large pot of lightly salted water to a boil. Add pasta and cook until al dente, 8 to 10 minutes; drain.\r\nWhile the pasta cooks, melt the butter in a large, deep skillet over medium heat. Cook and stir the garlic in the butter 1 to 2 minutes; season with salt and pepper. Stir in the yellow onion and 1\/2 tablespoon red pepper flakes; cook until the yellow onion becomes translucent. Add the crawfish tails; cook 2 to 3 minutes, stirring continually; transfer the crawfish to a bowl, leaving as many onions as possible in the skillet.\r\nPour the heavy cream into the skillet and bring to a boil; reduce heat to low, and simmer until thickened. Sprinkle the remaining 1\/2 tablespoon red pepper flakes into the cream, return the crawfish to the sauce and simmer 2 to 3 minutes. Serve sauce over the drained pasta; garnish with chopped green onion.\r\n",
      "Crawfish Bisque": "Ingredients:\r\n6 tablespoons butter  \r\n1 onion, chopped  \t\r\n1\/4 cup all-purpose flour  \r\n2 cups chicken broth\r\n3 cups half-and-half cream  \r\n1 teaspoon salt  \r\n1 1\/2 pounds peeled crawfish tails  \r\n1 teaspoon Worcestershire sauce  \r\n1 pinch cayenne pepper, or to taste  \r\nDirections:\r\nMelt the butter in a large saucepan over medium heat, and cook and stir the onion until golden, about 8 minutes. Stir in the flour until smooth, and cook and stir the mixture until it turns a pale golden color, about 5 minutes. Whisk in the chicken broth, stirring constantly to avoid lumps, then mix in the half-and-half, salt, crawfish tails, Worcestershire sauce, and cayenne pepper.\r\nReduce heat to medium-low, and continue whisking as soup comes to a simmer. Allow the bisque to simmer for about 5 minutes, until slightly thickened. Do not boil.\r\n"
    }
  },
  {
    "title": "Grilled and Fried Artichoke",
    "sections": {
      "Fried Artichoke Hearts": "Ingredients:\r\n1 can artichoke hearts, drained (8 1\/2 oz can) \r\n3 tbsp. olive oil \r\n3 cloves garlic, chopped \r\nfresh black pepper \r\nDirections:\r\nIn a medium frying pan, medium heat, sautee olive oil, garlic and artichoke hearts for 5-7 minutes until they are golden brown on all sides. Add the artichokes to a salad and serve! \r\n",
      "Grilled Artichokes with Zesty Rémoulade": "Ingredients:\r\n6 whole artichokes\r\n4 lemons, halved\r\n1 tablespoon plus 1 teaspoon salt, divided\r\n1 teaspoon olive oil\r\n½ teaspoon ground black pepper\r\nZesty Rémoulade\r\nZesty Rémoulade Sauce Ingredients:\r\n1 cup mayonnaise\r\n2 tablespoons chopped capers\r\n2 tablespoons chopped cornichons\r\n1 tablespoon chopped fresh parsley\r\n1 teaspoon lemon zest\r\n1 tablespoon lemon juice\r\n1 teaspoon ground paprika\r\n¼ teaspoon cayenne pepper\r\n1 teaspoon salt\r\n½ teaspoon ground black pepper\r\n1 teaspoon hot sauce, such as Tabasco\r\nSauce Directions:\r\nIn a small bowl, add mayonnaise, capers, cornichons, parsley, lemon zest and juice, paprika, cayenne, salt, black pepper, and hot sauce. Whisk until combined. Cover, and refrigerate until serving.\r\nDirections:\r\nIn a large pot of boiling water, cook artichokes, lemons, and 1 tablespoon salt until tender, about 10 minutes. Remove artichokes from water; let cool 30 minutes or until safe to handle.\r\nSpray grill rack with nonstick, nonflammable cooking spray. Preheat grill to medium-high (350° to 400°).\r\nHalve artichokes, and remove the choke with a spoon. Drizzle cut sides with olive oil, and season with remaining 1 teaspoon salt and pepper. Place, cut side down, on grill, cooking until slightly charred and the inside of artichoke is cooked through. Serve immediately with Zesty Rémoulade.\r\n"
    }
  },
  {
    "title": "King Cake Background and Recipes",
    "sections": {
      "King Cake Background": "What is King Cake\r\nKing Cakes are a vibrant part of the Mardi Gras tradition in New Orleans.\r\nAs part of New Orleans's Christian faith, the coming of the wise men bearing gifts to the Christ Child is celebrated twelve days after Christmas. We refer to this as the Feast of the Epiphany, or Little Christmas on the Twelfth Night. This is a time of celebration, exchanging gifts and feasting. Today, the tradition continues as people all over the world gather for festive Twelfth Night celebrations. A popular custom was and still is the baking of a special cake in honor of the three kings, called \"A King's Cake.\"\r\nEach king cake has a tiny baby inside (generally plastic now, but it's possible the baby might be made of porcelain or even gold). The tradition of King Cake Parties have evolved over time, and the \"lucky\" person who receives the slice of cake with the baby is asked to continue the festivities by having the next King Cake party (or at least purchasing the next cake for the office).\r\nOriginally, king cakes were a simple ring of dough with a small amount of decoration. Today's king cakes are much more festive. After the rich Danish dough is braided and baked, the \"baby\" is inserted. The top of the ring or oval cake is then covered with delicious sugar toppings in the traditional Mardi Gras colors of purple, green and gold.\r\nIn more recent years, some bakeries have been creative with stuffing and topping their cakes with different flavors of cream cheese and fruit fillings.\r\nJan. 6, the Twelfth Night after Christmas, is the day our Mardi Gras season, hence king cake season, begins. Mardi Gras Day, also known as Fat Tuesday, is always 47 days prior to Easter Sunday (the day before Ash Wednesday).\r\nMardi Gras and King Cakes go hand in hand...especially in Louisiana. Hundreds of thousands of king cakes are consumed at parties, offices and in homes every year.\r\nThe History of King Cakes\r\nToday in New Orleans, the King Cake is an oval-shaped braided cake similar to a coffee cake which has cinnamon within the braids and is decorated with icing and sugar the colors of gold (God's power), green (faith in Christ), and purple (Justice of God) - and contains a tiny plastic baby symbolic of the Baby Jesus usually baked within but sometimes placed within the cake after it has been baked.\r\nReligious tradition is bound to the King Cake. Thus, it is not surprising that the origin of the modern King Cake can be traced back to the Middle Ages, when popular devotion during Christmas not only centered on Jesus Christ, but, also included an interest in the \"Three Wise Men,\" or \"kings,\" who had followed a star leading them to pay homage to the Christ Child. The \"Epiphany,\" a Christian festival held on January 6th honors the \"Three Wise Men\" for having sought the worlds' Savior. It is also referred to as \"Twelfth Night\" since it arrives 12 days after Christmas. As such, the English definition of the term \"epiphany\" is \"a moment in which you suddenly see or understand something in a new or very clear way.\" The \"Three Wise Men\" are considered \"wise\" because they sought the Savior!\r\n",
      "King Cake Recipes": "KING CAKE DOUGH INGREDIENTS:\r\n4 packages active dry yeast\r\n1\/2 cup lukewarm water (110-115 degrees F)\r\n1\/2 cup granulated sugar\r\n1 tablespoon salt\r\n1\/2 cup cold milk\r\n1 cup plain or vanilla yogurt\r\n2 teaspoons lemon juice\r\n1 teaspoon vanilla extract\r\n2 egg yolks, lightly beaten\r\n1 stick butter or margarine\r\n5-6 1\/2 cups all-purpose flour\r\nKING CAKE FILLING INGREDIENTS:\r\n1 stick butter or margarine, melted\r\n2 cups granulated sugar\r\n3 tablespoons ground cinnamon\r\n2 dried bean, shelled pecans, or naked plastic babies\r\nKING CAKE ICING INGREDIENTS:\r\n3 tablespoons soft butter or margarine\r\n4 cups confectioner’s sugar\r\n1 teaspoon vanilla or almond extract\r\n4-6 tablespoons milk\r\nKING CAKE DIRECTIONS:\r\nCombine the yeast, 1\/2 of the sugar, and the lukewarm water in a very large bowl, stir well and set aside for a few minutes until the mixture swells slightly and small bubbles appear on the surface.\r\nStir in the remaining sugar, milk, yogurt, lemon juice, vanilla and salt. Mix well. Add egg yolks and mix again.\r\nIn another bowl, work the butter\/margarine into 5 cups of the flour. Add the flour-butter\/margarine mixture to the yeast mixture a cup at a time, mixing well after each cup is added. Begin to knead in the bowl, adding more flour if necessary to make a smooth, elastic dough.\r\nTurn out onto a lightly floured surface and knead about 5 minutes, adding more flour if the dough is still sticky. Shape the dough into a ball and place in a bowl which has been buttered or sprayed with a no-stick spray. Cover and let stand in a warm place until dough doubles in size. Punch dough down and divide in half. Roll each half on a lightly floured surface into a rectangle about 8 x 14 inches.\r\nBrush each rectangle with 1\/2 stick of melted butter or margarine. Combine the sugar and cinnamon and sprinkle 1\/2 of the mixture over each rectangle. Roll up from the wide end, as you would a jelly roll, inserting one of the dried beans, pecans, or naked babies along the way. Press the ends of the dough together and stretch the roll into an oval about 14 inches long.\r\nPlace on a greased\/sprayed cookie sheet and allow to rise in a warm place for about 45 minutes. Bake in a preheated 350 degree F oven for about 35-45 minutes until the cakes are golden brown and sound hollow when tapped with the fingers. Remove from the oven and cool for 30 minutes.\r\nBeat the butter or margarine until softened. Add confectioner’s sugar and vanilla and continue to beat, gradually adding milk until a glaze consistency is achieved. Use half of the icing on each cake. Spread the icing evenly over each cake and decorate immediately with granulated sugar that has been rendered purple, green and gold with food coloring, making alternating bands of color.\r\nOther decorating options: Divide the icing into three portions and use food coloring to make purple, green and gold icing. Spread in alternating bands along the length of the cakes. Use purple, green and gold gumdrops, jelly beans, or other candy to decorate the white icing.\r\n",
      "King Cake Bread Pudding": "•\t1 small King Cake, cubed (8-10 cups) and plastic baby discarded\r\n•\t1 8-ounce package cream cheese, softened\r\n•\t4 tablespoons butter, softened\r\n•\t1 cup sugar\r\n•\t2 eggs\r\n•\t1 14-ounce can sweetened condensed milk\r\n•\t2 cups half-n-half\r\n•\t2 teaspoons pure vanilla extract\r\n•\t2 teaspoons ground cinnamon\r\n•\tPinch of salt\r\n•\t3 cups powdered sugar\r\n•\t4 tablespoons milk\r\n•\t3 tablespoons fresh lemon juice\r\n•\tPurple, green and gold (yellow) sugar sprinkles*\r\n•\tWhiskey Sauce, recipe follows\r\nPreheat oven to 325 degrees F. Generously butter a large baking dish. Place cubed King Cake in prepared dish; set aside. In the bowl of an electric mixer with paddle attachment, combine cream cheese, butter and sugar. Beat on low until creamy, about 3 minutes. Add eggs one at a time, beating until smooth after each addition. Add condensed milk, half-and-half, vanilla extract, cinnamon and salt; mix well. Pour mixture over king cake. Soak at room temperature, stirring occasionally, until cake has absorbed most of the liquid, about 30 minutes. Set baking dish in a roasting pan and fill the pan halfway with hot water. Bake, uncovered, until a knife inserted into the center comes out clean and top begins to brown, 45 minutes to 1 hour. When bread pudding is done, carefully remove from water bath and let cool for 20 minutes. Meanwhile, make a glaze. In a large bowl, combine powdered sugar, milk and lemon juice until smooth. Pour over bread pudding and decorate with alternating colors of sugar sprinkles. Serve warm with Whiskey Sauce.   Makes 8-10 servings.\r\nWhiskey Sauce Recipe\r\n•\t1 stick butter\r\n•\t1 cup sugar\r\n•\t1 large egg\r\n•\t1\/2 cup whiskey\r\nMelt butter in the top of a double boiler set over hot, but not boiling, water (or in a Pyrex bowl set over a saucepan of simmering water).  In a separate bowl, beat sugar and egg together; add to melted butter, whisking vigorously to prevent egg from curdling.  Cook, whisking constantly, until sugar is dissolved and egg is cooked, 3-4 minutes.  Remove sauce from heat and stir in whiskey.  Makes about 1 cup."
    }
  },
  {
    "title": "Meat Pies and Drop Biscuits",
    "sections": {
      "Cajun Natchitoches Meat Pies": "Ingredients:\r\n1 teaspoon shortening \r\n1 pound ground beef \r\n1 pound ground pork \r\n1 bunch green onions, chopped \r\n1 pod garlic, chopped \r\n1 bell pepper, chopped \r\n1 medium onion, chopped \r\nSalt, black and red pepper to taste. \r\n1 tablespoon flour \r\nMeat Pie Crust:\r\n1 quart plain flour \r\n2 teaspoons salt \r\n1 teaspoon baking powder \r\n2 eggs \r\n1\/2 shortening + 1 tablespoon \r\n1 cup milk\r\nDirections:\r\nMelt shortening in heavy pot. Add meat. Cook until pink is gone. Add vegetables and season to taste. (Season well, as meat will lose seasoning during frying.) When meat is completely done and vegetables are glazed, remove from heat and drain excess liquid. Stir in 1 tablespoon flour.\r\nSift dry ingredients together. Cut in shortening. Beat egg and add to milk. Work gradually into dry ingredients until proper consistency to roll. Break into small pieces and roll very thin. Cut into rounds using a saucer as a guide.\r\nTo assemble:\r\nPlace a large tablespoon of prepared meat along edge and halfway in the center of round dough. Fold the other half over, making edges meet and seal with water. Form edges with fork. Drop in deep fat and cook until golden brown. Drain and serve hot.\r\n",
      "Drop Biscuits": "Ingredients:\r\n4 cups all-purpose flour\r\n¼ cup sugar\r\n2 teaspoons baking powder\r\n1 tablespoon salt\r\n¾ cup unsalted butter, chilled and cubed\r\n2½ cups whole buttermilk\r\n¼ cup unsalted butter, melted\r\nDirections:\r\nPreheat oven to 400°. Line 2 rimmed baking sheets with parchment paper.\r\nIn a large bowl, combine flour, sugar, baking powder, salt, and ¾ cup cold butter together using a pastry blender until mixture has pea-size pieces of butter.\r\nAdd buttermilk, mixing until just incorporated.\r\nUse a spoon or a large spring-loaded (3-tablespoon) scoop, divide mixture into 24 mounds on prepared baking sheets. Chill on baking sheets until ready to bake.\r\nBake until golden brown, about 15 to 20 minutes. Brush biscuits halfway through baking time with ¼ cup melted butter."
    }
  },
  {
    "title": "Pralines and Sweet Potato Pancakes",
    "sections": {
      "Pralines": "Ingredients:\r\n2 cups chopped pecans  \r\n1\/2 cup confectioners' sugar  \r\n1 1\/2 cups white sugar  \r\n1\/2 cup buttermilk  \r\n1\/4 cup heavy cream  \r\n2 tablespoons butter\r\n1\/8 teaspoon salt  \r\n3\/4 teaspoon baking soda  \r\n1\/2 teaspoon vanilla extract  \r\nDirections: \r\nPreheat the oven to 275 degrees F (135 degrees C). Spread pecans out on a baking sheet in a single layer. Bake for 15 minutes in the preheated oven, or until fragrant. Set aside.\r\nIn a saucepan, stir together the confectioners' sugar, white sugar, buttermilk, heavy cream, butter, and salt. Bring to a boil over medium heat. When the mixture begins to boil, start stirring gently with a wooden spoon, and continue cooking until the mixture is slightly above the soft ball stage to 250 degrees F (120 degrees C).\r\nRemove from heat, and stir in baking soda and vanilla. The mixture will expand some while stirring. Cool for 10 to 15 minutes, then stir in pecans. Keep stirring with a wooden spoon until the mixture loses its gloss. Drop teaspoonfuls of the mixture onto parchment paper that has been coated with butter flavored non-stick spray. Allow to cool completely.\r\n",
      "Sweet Potato Pancakes": "Ingredients:\r\n3\/4 pound sweet potatoes  \r\n1 1\/2 cups all-purpose flour  \r\n3 1\/2 teaspoons baking powder  \r\n1 teaspoon salt  \r\n1\/2 teaspoon ground nutmeg  \r\n2 eggs, beaten  \r\n1 1\/2 cups milk  \r\n1\/4 cup butter, melted\r\nDirections: \r\nPlace sweet potatoes in a medium saucepan of boiling water, and cook until tender but firm, about 15 minutes. Drain, and immediately immerse in cold water to loosen skins. Drain, remove skins, chop, and mash.\r\nIn a medium bowl, sift together flour, baking powder, salt, and nutmeg. Mix mashed sweet potatoes, eggs, milk and butter in a separate medium bowl. Blend sweet potato mixture into the flour mixture to form a batter.\r\nPreheat a lightly greased griddle over medium-high heat. Drop batter mixture onto the prepared griddle by heaping tablespoonfuls, and cook until golden brown, turning once with a spatula when the surface begins to bubble.\r\n"
    }
  },
  {
    "title": "Soft Shell Crab Collection",
    "sections": {
      "Soft Shell Crabs Broussardville": "Ingredients: \r\n1 lb Margarine\r\n 6 medium soft shell crabs\r\n Cajun seasoning blend\r\n Sliced french bread\r\n Bordelaise sauce\r\n Pesto sauce\r\nBordelaise Sauce:\r\nMargarine\r\n2 tbsp olive oil\r\n7 cloves of garlic chopped\r\n1\/2 tsp salt\r\n1\/4 tsp black pepper\r\n1 tbsp minced fresh parsley\r\nPesto Sauce:\r\n2 cups fresh basil\r\n4 cloves garlic minced\r\n1 c. walnuts\r\n1 c. olive oil\r\n1 c. freshly grated Parmesan cheese\r\n1\/4 c. freshly grated Romano cheese\r\nSalt and ground pepper to taste\r\nDirections:\r\nIn a food processor, chop basil, garlic and walnuts. With it running, slowly add olive oil in a steady stream. Add cheeses, salt and pepper and pulse the mixer a couple times. Set aside.\r\nDredge the cleaned crabs in margarine and place in a hot skillet. Add about 1\/3 of the margarine and sauté crabs about 2- 3 minutes per side. Season to taste with blend during the sautéing. Remove the crabs and place on warm platter, add all ingredients for Bordelaise except the parsley, sauté 3-4 minutes, remove from heat and add parsley.\r\nLay slices of french bread on the plate, cover with Bordelaise, add crabs and top with pesto, season to taste.  \r\n",
      "Soft Shell Crabs Juliette": "Ingredients: \r\n12 medium soft shell crabs\r\n3 c. light oil\r\n2 cups milk and 2 eggs or just 2 cups buttermilk\r\n4 cups fish fry or seasoned corn flour\r\n2 cups seasoned flour\r\nsalt, granulated garlic, red-white-black pepper to taste, thyme and basil.\r\n3 large tomatoes\r\n2 eggplant\r\nBéarnaise Sauce\r\nDirections:\r\nWash crabs thoroughly under cold water. Lift the end points on the crabs and remove the gills (dead man). Wash again. flip crab over and remove the back flap. Wash again. Cut off the mouth and cut out the eyes and eye stems. Wash again. Let crabs drain in colander about 30 minutes to drain. Season them with salt, peppers, basil, thyme and garlic.\r\nPeel and slice eggplant, soak eggplant in salted water about 30 minutes. If you have a grill, thickly slice tomato and grill the slices, keep warm. If you have no grill, just lightly warm them in a buttered sauté pan.  Fry the eggplant by dipping in eggwash or buttermilk and seasoned flour.  Dip crabs in egg wash then corn flour, shake off, repeat then pan fry in\r\n375 degree oil.  Place two eggplant slices on the plate, top with grilled tomato, then the crab, top with béarnaise sauce.  \r\n"
    }
  },
  {
    "title": "Turtle Soup and Crawfish Chili",
    "sections": {
      "Turtle Soup": "Ingredients:\r\n3 lbs turtle meat, cut into 1-inch cubes\r\n1 cup oil\r\n1 cup flour\r\n1 cup diced onions\r\n1 cup diced celery\r\n6 cloves chopped garlic\r\nOne 8 ounce can tomato sauce\r\n2 quarts water\r\n1\/4 cup beef extract\r\n2 ts celery salt\r\n4 bay leaves\r\n2 lemons, halved\r\n1 ts thyme\r\n1\/2 chopped parsley\r\nGarnish: sliced lemon, chopped egg, sherry\r\nDirections:\r\nSaute meat in oil until brown. Set aside.\r\nBrown flour, and add onion, celery and garlic. Cook 10 minutes\r\nAdd remaining ingredients and turtle meat. Simmer about 2 hours until meat is very tender.\r\nGarnish with sliced lemon, chopped egg and sherry before serving.\r\nYields: 1 gallon\r\n",
      "Cajun Crawfish Chili": "Ingredients:\r\n2 lb Lean ground beef\r\n2 lb Crawfish tails\r\n1 ts Garlic, chopped fine\r\n2 ts Salt\r\n1 tb Soy sauce\r\n1 ts Cayenne pepper\r\n1 ts Dried mint\r\n1 tb Dried parsley\r\n3 tb Chili powder\r\n1 cn (8 oz) tomato sauce\r\n1 c Dry white wine\r\nWater\r\n1 ts Lemon or lime juice\r\n1 c Chopped onions\r\nBacon drippings\r\nDirections:\r\nBrown meat in bacon drippings. \r\nCombine all other ingredients with meat and bring to a boil. Simmer for a few hours.\r\nServe hot.\r\n"
    }
  }
]