[
  {
    "title": "Louisiana Boiled Crawfish",
    "sections": {
      "Equipment": "Remember that deep fry turkey cooker that’s lurking in the back of the kitchen closet? That is exactly what you need for a crawfish boil. The large pot with a tight fitting lid will be perfect. You will also need a wire basket insert to remove the crawfish and vegetables after they are cooked. The whole assembly sits on a propane burner. You will also need a large tub or ice chest (the one that the crawfish are shipped in is perfect), or a couple of bags of ice. A stirring paddle or long-handled spoon is useful too.",
      "Ingredients": "Fresh mushrooms\r\nLemons\r\nCrawfish boil \r\nOnions\r\nPotatoes\r\nEars of corn\r\nGarlic heads\r\nHot dogs\/sausage (optional)\r\n",
      "Crawfish Boil": "Many New Orleans cooks recommend Zataran’s crab boil, which comes in dry and liquid forms. If you are a DIY cook, Alton Brown has a recipe for crawfish spice mix, or if you just want to make it easy… and extra delicious, use the seasoning that comes with your crawfish order (it’s cajuncrawfish.com’s special blend). If you’re a foodie and want to mix your own… grind 1 tablespoon each of whole black peppercorns and whole coriander seeds, 2 tablespoons whole cloves and 1 ½ tablespoons whole allspice in a spice grinder. Mix ground spices together with 4 tablespoons cayenne pepper, 2 tablespoons garlic powder, 2 tablespoons paprika, and 1 tablespoon each of onion powder, dried thyme, dried oregano, dry mustard, dried dill weed, plus 6 crumbled bay leaves. Add the spice mix and 1 pound of kosher salt to 5 gallons of boiling water for the crab boil. This is enough spice to boil 10 pounds of crawfish. If using cajuncrawfish.com spice, use 1 bag per 10 lbs. of crawfish.",
      "Directions": "Add 5 gallons of water to the pot for each 10 pounds of crawfish. When the water boils, add half of the spice mix. Add the potatoes, corn, onions and garlic to the pot and cover. If you are adding andouille sausage, this is the time to add it, too. Let cook for ten minutes, then add the crawfish and replace the cover. Ed the Crawfish Master at the Cajun Crawfish Company says to watch for steam to escape from under the lid. When this happens, turn off the gas.\r\nYou can remove the basket from the pot and transfer the crawfish to an ice chest. Add one third of the crawfish to the chest, sprinkle with spice mix; add another third of the crawfish, sprinkle with spice mix, and then add the rest of the crawfish and sprinkle with more spices. You can also add two bags of ice to the pot instead of removing the crawfish. The ice will cool them down and they will sink to the bottom and absorb more spices.\r\n"
    }
  },
  {
    "title": "Cajun Jambalaya",
    "sections": {
      "Ingredients": "1 lb. cubed pork \r\n1 teaspoon Cajun seasoning \r\n1 tablespoon vegetable oil \r\n½ lb. smoked sausage, sliced \r\n1 cup chopped onion \r\n½ cup chopped green bell pepper \r\n½ cup chopped celery \r\n1 tablespoon minced garlic \r\n1 tablespoon dark roux \r\n½ cup water 2 cups rice \r\n3½ cup beef broth \r\n2 bay leaves\r\n1 teaspoon hot sauce \r\n¼ cup chopped green onions\r\n2 tablespoons minced parsley\r\n",
      "Directions": "Season pork with Cajun seasoning. In a large sauce pot heat oil, stir in seasoned pork and cook over medium heat for 10 minutes, stirring occasionally. Add smoked sausage and cook for additional 5 minutes. Stir in onion, bell pepper, celery, garlic and cook for 5 minutes. Stir in roux and water, cover pot and cook for 10 minutes, stirring occasionally. Stir in rice and cook for 1 minute; add beef broth, bay leaves and hot sauce. Bring to boil, cover pot, and turn fire as low as it will go and cook for 30 minutes, stirring every 10 minutes. Stir in green onions and parsley and serve."
    }
  },
  {
    "title": "Banana Crepes",
    "sections": {
      "Ingredients": "•\t12 dessert crepes, purchased or homemade \r\n•\t3\/4 cup sour cream \r\n•\t1 package (8 ounces) cream cheese \r\n•\t3 tablespoons granulated sugar \r\n•\t1 tablespoon vanilla extract \r\n•\t1\/4 cup chopped pecans \r\n•\t6 medium bananas \r\n•\t1\/2 cup light brown sugar, packed \r\n•\t1 teaspoon ground cinnamon \r\n•\t1\/2 cup butter \r\n•\tjuice of 1\/2 lemon, about 1 to 1 1\/2 tablespoons \r\n",
      "Preparation": "Combine sour cream and cream cheese; mix until well blended and smooth. Add granulated sugar, vanilla and pecans; blend well. Spoon cream cheese mixture evenly on the crepes and roll up with the ends left open. Place on a shallow serving tray. At this point, the prepared crepes may be refrigerated. Bring to room temperature before serving.\r\nPeel and slice bananas crosswise into approximately 1\/2-inch thick rounds; arrange in a casserole.\r\nCombine brown sugar and cinnamon; set aside. Melt butter and pour evenly over bananas in casserole. Sprinkle with the lemon juice and top with the brown sugar-cinnamon mixture. \r\nBake at 350° for 20 minutes. Remove from oven and spoon bananas with spiced syrup over the crepes. Serve immediately.\r\nServes 6.\r\n"
    }
  },
  {
    "title": "Beignets",
    "sections": {
      "What are beignets?": "Beignet, synonymous with the English \"fritter\", is the French term for a pastry made from deep-fried choux pastry. Beignets can also be made from other types of dough, including yeast dough. They are typically fried and topped with powdered sugar.",
      "History of beignets": "While the exact origins of beignets are cause for debate, it is known that the French colonists of the eighteenth century are responsible for introducing the deep fried pastry to New Orleans. Some believe it was the Ursuline nuns of France who brought the recipe with them when they came to Louisiana in 1727. The original beignets were fried fritters sometimes filled with fruit. Today they are most commonly served as a square piece of fried dough liberally covered with powdered sugar and an occasional sprinkle of cinnamon.\r\n",
      "Ingredients": "1 1\/2 cups lukewarm water\r\n1\/2 cup granulated sugar\r\n1 envelope active dry yeast\r\n2 eggs, slightly beaten\r\n1 1\/4 teaspoons salt\r\n1 cup evaporated milk\r\n7 cups bread flour\r\n1\/4 cup shortening\r\nNonstick spray\r\nOil, for deep-frying\r\n3 cups confectioners' sugar\r\n",
      "Directions": "Mix water, sugar, and yeast in a large bowl and let sit for 10 minutes.\r\nIn another bowl, beat the eggs, salt and evaporated milk together. Mix egg mixture to the yeast mixture. In a separate bowl, measure out the bread flour. Add 3 cups of the flour to the yeast mixture and stir to combine. Add the shortening and continue to stir while adding the remaining flour. Remove dough from the bowl, place onto a lightly floured surface and knead until smooth. Spray a large bowl with nonstick spray. Put dough into the bowl and cover with plastic wrap or a towel. Let rise in a warm place for at least 2 hours.\r\nPreheat oil in a deep-fryer to 350 degrees F.\r\nAdd the confectioners' sugar to a paper or plastic bag and set aside.\r\nRoll the dough out to about 1\/4-inch thickness and cut into 1-inch squares. Deep-fry, flipping constantly, until they become a golden color. After beignets are fried, drain them for a few seconds on paper towels, and then toss them into the bag of confectioners' sugar. Hold bag closed and shake to coat evenly.\r\n"
    }
  },
  {
    "title": "Tarte a la Bouille",
    "sections": {
      "What is tarte à la bouille?": "A traditional Cajun custard pie made with soft, sweet dough.",
      "What does tarte à la bouille mean?": "It loosely translates to a pie filled with boiled cream or custard.",
      "Ingredients": "½ cup sugar\r\n5 tablespoons cornstarch\r\n3 cups cold half-and-half\r\n1 teaspoon vanilla extract\r\nSweet Dough, recipe follows\r\n",
      "Directions": "Preheat oven to 350°.\r\nIn a small bowl, combine sugar and cornstarch. In another small bowl, add half-and-half. Stir cornstarch mixture into the half-and-half.\r\nIn a medium saucepan, cook half-and-half mixture over medium heat, stirring constantly, until thickened. Stir in vanilla. Remove from heat. Once slightly cooled, place plastic wrap over surface to prevent skin from forming.\r\nOn a well-floured surface, roll Sweet Dough into a 13-inch circle; transfer to a 10-inch deep-dish pie plate. Add half-and-half mixture, and fold remaining dough over onto the half-and-half mixture.\r\nBake until crust is golden brown, about 25 to 30 minutes. Let pie cool to room temperature, then refrigerate 4 hours before slicing.\r\n"
    }
  },
  {
    "title": "Shrimp Fritters",
    "sections": {
      "Ingredients": "•\t3 tablespoons butter \r\n•\t1 pound medium shrimp, peeled and deveined \r\n•\t4 green onions, finely chopped (include tops) \r\n•\t1 bell pepper, seeded and finely chopped \r\n•\t1 small hot or mild chile pepper, seeded and finely chopped \r\n•\t2 cups mashed potatoes \r\n•\t2 eggs, beaten \r\n•\tsalt and pepper, to taste \r\n•\t1 cup fine dry bread crumbs \r\n•\tvegetable oil, for deep frying \r\nPrep Time: 15 minutes \r\nCook Time: 25 minutes \r\nTotal Time: 40 minutes \r\nYield: 2 Dozen \r\n",
      "Directions": "Melt butter in skillet or sauté pan over medium heat; add the shrimp and cook until pink (2 to 3 minutes depending on size). Remove shrimp from skillet with a slotted spoon, cool slightly, then chop. Set aside.\r\nAdd the green onions, bell pepper and chile pepper to the butter remaining in the skillet. Saute over medium heat until vegetables are just softened, about 3 minutes. Add mixture to the mashed potatoes and mix well.\r\nStir in the chopped shrimp and beaten eggs. Season to taste with salt and pepper. Stir in some of the bread crumbs, if needed to make the dough stiff enough to form into balls.\r\nShape mixture into 2-inch balls.\r\nPut the bread crumbs in a shallow bowl.\r\nRoll the shrimp-potato balls in the crumbs. Cover and chill for at least 30 minutes or up to 4 hours.\r\nHeat oil in a deep fryer or heavy pot to about 360° F.\r\nFry the balls 3 or 4 at a time for about 4 minutes, or until browned and crispy on the outside.\r\nRemove balls to paper towels; drain and serve immediately.\r\nMakes about 2 dozen small fritters.\r\n"
    }
  },
  {
    "title": "Shrimp Creole",
    "sections": {
      "Ingredients": "•\t1 lb. shrimp, remove tail\/shells \r\n•\t1 large bell pepper, cored and coarsely chopped \r\n•\t1 large onion, coarsely chopped \r\n•\tgarlic, oregano, cayenne pepper, crushed red pepper, basil \r\n•\tlong grain and wild rice, prepared according to directions \r\n•\t1 can of kidney beans, drained \r\n•\t1 quart tomato sauce* (Newman's or any tomato & basil blend is good - preferably one that is very mildly seasoned) \r\n•\tSalt and black pepper to taste \r\n",
      "Peparation": "Put shrimp in water, bring to a rolling boil and boil just long enough for shrimp to turn pink. Remove from heat, dump into a colander to drain and set aside.\r\nIn a large skillet, use a tablespoon of olive oil, sauté peppers and onions on medium high heat until just tender. Add in shrimp. Add 1 teaspoon of peppers, 1 tablespoon of each of the other seasonings listed above. Stir, then stir in tomato sauce.\r\nStir and allow to simmer until it is gently bubbling. Add more seasonings to taste. It should be fairly pepper-hot. You can add a dash of salt or black pepper if you like.\r\nMix rice with kidney beans, Serve Creole over rice.\r\nI usually make a large tossed salad and bread sticks to serve with this.\r\n*Note from McGentry: I make my own homemade tomato sauce, so suggesting a store brand is difficult. The main thing is to stay away from the meat sauces or heavily seasoned ones, they simply aren't as good. The whole point of Creole is to balance the taste of shrimp, tomato, and the seasonings without overpowering any one item.\r\n"
    }
  },
  {
    "title": "Fried & Smothered Okra",
    "sections": {
      "Friend Okra Recipe": "Ingredients\r\n1 lb. fresh okra\r\n2 cups buttermilk\r\n1 cup self-rising cornmeal\r\n1 cup self-rising flour\r\n1 tsp. salt\r\n1\/4 tsp. ground red pepper\r\nVegetable oil\r\n1\/4 cup bacon drippings\r\nDirections\r\nCut off and discard tip and stem ends from okra; cut okra into 1⁄2-inch-thick slices. Stir into buttermilk; cover and chill 45 minutes.\r\nCombine cornmeal and next 3 ingredients in a bowl. Remove okra from buttermilk with a slotted spoon, and discard buttermilk. Dredge okra, in batches, in the cornmeal mixture.\r\nPour oil to a depth of 2 inches into a dutch oven or cast-iron skillet; add bacon drippings, and heat to 375°. Fry okra, in batches, 4 minutes or until golden; drain on paper towels.\r\n",
      "Smothered Okra Recipe": "Ingredients\r\n8 cups sliced okra (1 1\/2 lbs.) \r\n1\/2 cup vegetable oil \r\n2 slices of smoked bacon, cooked and crumbled \r\ndripping from 2 slices of cooked smoked bacon \r\n1 medium white onion, chopped \r\n1 tsp. garlic \r\nsalt and black or white pepper to taste \r\nDirections\r\nUsing medium heat, add the vegetable oil and bacon drippings into a large skillet (use a stainless or aluminum skillet to maintain the okra's greenish color, a cast-iron skillet will produce a darker meal)\r\nWhen the oil heats-up and begins to smoke, add the remaining ingredients and continue cooking, stirring occasionally, until the mucilage (slime) disappears (20 - 30 minutes).\r\nConstantly stirring the cut okra is very important if you want to keep it from sticking to the bottom of the skillet.\r\n"
    }
  },
  {
    "title": "New Orleans File Gumbo",
    "sections": {
      "Gumbo Base": "1 lb. Creole or smoked sausage, sliced 1\/2\" thick\r\n1\/2 lb. lean baked ham, cut into 1\/2\" cubes\r\n1 fryer, cut up\r\n1\/2 lb. shrimp, peeled\r\n1\/2 lb. white fish fillets\r\n1\/2 c. chopped green pepper\r\n1\/2 c. thinly sliced green scallion\r\n2 tbsp. finely minced parsley\r\n1 tbsp. finely minced garlic\r\n2 c. chopped onion\r\n1 lg. ham bone, cut into 3\" lengths (optional)\r\n",
      "Roux": "2\/3 c. vegetable oil\r\n2\/3 c. flour\r\n",
      "Seasoning": "2 qt. cold water\r\n3 1\/2 tsp. salt (less if cooking with ham bone)\r\n1 1\/4 tsp. freshly ground black pepper\r\n1 tsp. dried thyme\r\n3 whole bay leaves\r\n2 1\/2-3 tbsp. file powder\r\n1\/8 tsp. cayenne\r\n1\/2 tsp. dried marjoram\r\n",
      "Directions": "After assembling the ingredients for the gumbo base, heat the oil in a heavy 7-8 quart pot or kettle over high heat. Brown the chicken parts in the hot oil, turning several times to ensure even browning. When the chicken is brown, remove it to a heated platter and place, uncovered, in a preheated 175 degree oven to keep it warm.\r\nMake the roux by gradually adding the flour to the oil in the pot, stirring constantly. Cook over low heat until a dark brown roux (the color of peanut butter) is formed. Do not try to hurry this step. The roux is the most important part of any gumbo base, and will take approximately 20-30 minutes of stirring to get it right. It's worth the wait.\r\nWhen the roux reaches the right color, quickly add the sausage, onion, green pepper, scallion tops, ham, parsley and garlic. Continue cooking over low heat for 10 minutes more, still stirring, then add 1\/4 cup of the water, the reserved chicken pieces and all the seasonings except the file powder; mix thoroughly. Gradually stir in the rest of the water. Raise the heat and bring to a boil, then lower the heat and simmer the gumbo for 50 minutes to 1 hour, or until the chicken parts are tender. Stir frequently, taking care not to break the pieces of chicken.\r\n"
    }
  },
  {
    "title": "Louisiana Chicken",
    "sections": {
      "Quantities": "Prep Time: 20 minutes \r\nCook Time: 45 minutes \r\nTotal Time: 65 minutes \r\nYield: 4 Servings \r\n",
      "Ingredients": "•\t1 tablespoon butter \r\n•\t1 tablespoon vegetable oil \r\n•\tbroiler-fryer chicken, about 3 to 3 1\/2 pounds, cut in serving pieces \r\n•\t1 medium onion, sliced \r\n•\t2 cloves garlic, smashed and minced \r\n•\t2 tablespoons all-purpose flour \r\n•\t1 can (14.5 ounces) diced tomatoes, undrained \r\n•\t1 teaspoon leaf thyme, crumbled \r\n•\t2 teaspoons dried parsley leaves \r\n•\t1 bay leaf \r\n•\t1 teaspoon salt \r\n•\t1\/4 teaspoon Tabasco sauce \r\n•\t2 cups chopped green bell pepper \r\n•\t1 cup chopped red bell pepper \r\n•\thot cooked rice \r\n",
      "Preparation": "1.\tIn a large skillet or sauté pan pan over medium heat, melt butter with the vegetable oil. Sauté chicken slowly until nicely browned on all sides. Remove chicken pieces as they brown.\r\n2.\tAdd onion and garlic to chicken drippings and sauté until onion is tender, or about 5 minutes.\r\n3.\tLower heat to medium low; blend in flour and cook, stirring, for 2 minutes.\r\n4.\tRemove skillet from heat. Stir in tomatoes, thyme, parsley, bay leaf, salt, and Tabasco sauce. Add chicken pieces back to the skillet.\r\n5.\tReturn to heat and cook over low heat, stirring occasionally, for 15 minutes. Add green and red bell pepper. Cover and continue to cook over low heat for about 25 minutes longer, or until chicken is tender and cooked through.\r\n6.\tServe with hot cooked rice, a tossed salad, and crusty French bread.\r\nServes 4.\r\n"
    }
  },
  {
    "title": "Dirty Rice",
    "sections": {
      "What is dirty rice?": "Dirty rice is a traditional Cajun and Creole dish made from white rice which gets a \"dirty\" color from being cooked with small pieces of chicken liver or giblets, green bell pepper, celery, and onion, and spiced with cayenne and black pepper.",
      "History of Dirty Rice": "Much of the History and origin of this dish was hidden from History and therefore not accurately recorded. Consequently, much has become lost in translation, as have many other African Americans contributions. Some place its origin in the Coastal States of the Louisiana Bayou and some in the Carolina Low Country.",
      "Ingredients": "1 lb ground pork\r\n1 lb ground chuck\r\n2 cups onions, chopped\r\n1 cup green bell pepper, chopped\r\n1 cup celery, chopped\r\n2 tablespoons garlic, minced\r\n1⁄2 cup dark roux \r\n1 tablespoon Cajun seasoning\r\n1 teaspoon salt\r\n6 cups beef stock\r\n2 tablespoons Worcestershire sauce\r\n2 bay leaves\r\n1 teaspoon dried thyme (or 1 tablespoon fresh thyme)\r\n1 teaspoon hot sauce\r\n1 teaspoon black pepper\r\n1⁄4 cup parsley, chopped\r\n1⁄2 cup green onion, chopped\r\n15 cups cooked rice, packed\r\n",
      "Directions": "Heat large pot over medium heat. Add pork and beef and cook until meat is browned.\r\nAdd 1 cup of onions, 1\/2 cup of bell pepper, 1\/2 cup of celery, 2 tablespoons garlic and sauté for 2 minutes.\r\nAdd dark roux and cook for additional 5 minutes.\r\n"
    }
  },
  {
    "title": "Hog's Head Cheese",
    "section": {
      "History of (Hog’s) Head Cheese": "Head cheese or brawn is a cold cut meat jelly that originated in Europe. Historically, meat jellies were made of the cleaned (all organs removed) head of the animal, which was simmered to produce stock, a peasant food made since the Middle Ages. When cooled, the stock congeals because of the natural gelatin found in the skull. The aspic may need additional gelatin, or more often, reduction to set properly."
    }
  }
]